Repository: kodi-game/game.libretro.desmume
Catalog: game.libretro.desmume/resources/language/resource.language.*/strings.po
Languages: da_dk, de_de, es_es, ga, zh_cn

# Addon Description
source: DeSmuME is software that allows you to emulate a Nintendo DS system.
da_dk: DeSmuME er software, der giver dig mulighed for at efterligne et Nintendo DS-system.
de_de: DeSmuME ist eine Software, mit dem sich das Nintendo-DS-System emulieren lässt.
es_es: DeSmuME es un software que permite emular una videoconsola Nintendo DS.
ga: Is bogearraí é DeSmuME a ligeann duit córas Nintendo DS a aithris.
zh_cn: Desmune 是一款模拟任天堂 DS 系统的软件。

# Addon Disclaimer
source: Special thanks to yopyop (original author of DeSmuME) and Martin Korth (author of GBATEK)
da_dk: Særlig tak til yopyop (oprindelig udvikler af DeSmuME) og Martin Korth (udvikler af GBATEK)
de_de: Besonderen Dank an yopyop (ursprünglicher Autor von DeSmuME) und Martin Korth (Autor von GBATEK)
es_es: Agradecimientos especiales a yopyop (autor original de DeSmuME) y Martin Korth (autor de GBATEK)
ga: Buíochas speisialta le yopyop (údar bunaidh DeSmuME) agus Martin Korth (údar GBATEK)
zh_cn: 特别感谢 yopyop（DeSmuME的原作者）和 Martin Korth（GBATEK 的作者）

# #30000
source: Settings
da_dk: Indstillinger
de_de: Einstellungen
es_es: Ajustes
zh_cn: 设置

# #30001
source: Firmware Language
da_dk: Sprog til firmware
de_de: Sprache der Firmware
es_es: Lenguaje del Firmware
ga: Teanga Dochtearraí
zh_cn: 固件语言

# #30002
source: Use External BIOS/Firmware (restart)
da_dk: Anvend ekstern BIOS/firmware (genstart)
de_de: Externe(s) BIOS/Firmware verwenden (Neustart erforderlich)
es_es: Utilizar BIOS/Firmware Externo (reiniciar)
ga: Úsáid BIOS/Firmware Seachtrach (atosú)
zh_cn: 使用外部 BIOS/固件（重新启动）

# #30003
source: Boot Into BIOS (interpreter and external bios only)
da_dk: Boot til BIOS (kun fortolker og intern bios)
de_de: Ins BIOS booten (nur Interpreter und externes Bios)
es_es: Arrancar En BIOS (sólo intérprete y bios externa)
ga: Tosaithe isteach sa BIOS (ateangaire agus bios seachtracha amháin)
zh_cn: 引导到 BIOS（仅限解释器和外部 BIOS）

# #30004
source: Load Game Into Memory (restart)
da_dk: Indlæs spil i hukommelsen (genstart)
de_de: Spiel in den Speicher laden (Neustart erforderlich)
es_es: Cargar Juego En Memoria (reiniciar)
ga: Luchtaigh Cluiche isteach sa Chuimhne (atosaigh)
zh_cn: 将游戏加载到内存（重新启动）

# #30005
source: CPU Cores
da_dk: CPU-kerner
de_de: CPU-Kerne
es_es: Núcleos CPU
ga: Croíleacáin LAP
zh_cn: CPU 核

# #30006
source: CPU Mode (restart)
da_dk: CPU-tilstand (genstart)
de_de: CPU-Modus (Neustart erforderlich)
es_es: Modo CPU (reiniciar)
ga: Mód LAP (atosú)
zh_cn: CPU 模式（重新启动）

# #30007
source: JIT Block Size
da_dk: JIT-blokstørrelse
de_de: JIT-Blockgröße
es_es: Tamaño de Bloque JIT
ga: Méid Bloc JIT
zh_cn: JIT 块大小

# #30008
source: Enable Advanced Bus-Level Timing
da_dk: Aktiver avanceret timing af bus-niveau
de_de: Erweitertes Bus-Level-Timing aktivieren
es_es: Activar Temporización Avanzada a Nivel de Bus
ga: Cumasaigh Amú Ardleibhéil Bus
zh_cn: 启用高级总线级定时

# #30009
source: Frameskip
da_dk: Spring frame over
es_es: Salto de Fotogramas
ga: Fráma-léim
zh_cn: 帧跳过

# #30010
source: Internal Resolution
da_dk: Intern opløsning
de_de: Interne Auflösung
es_es: Resolución Interna
ga: Rún Inmheánach
zh_cn: 内部分辨率

# #30011
source: OpenGL Rasterizer (restart)
da_dk: OpenGL rasterizer (genstart)
de_de: OpenGL-Rasterer (Neustart erforderlich)
es_es: Rasterizador OpenGL (reiniciar)
ga: Rasterizer OpenGL (atosú)
zh_cn: OpenGL 光栅化器（重新启动）

# #30012
source: OpenGL: Color Depth (restart)
da_dk: OpenGL: farvedybde (genstart)
de_de: OpenGL: Farbtiefe (Neustart erforderlich)
es_es: OpenGL: Profundidad de Color (reiniciar)
ga: OpenGL: Doimhneacht Datha (atosú)
zh_cn: OpenGL：色深（重新启动）

# #30013
source: OpenGL: Multisampling AA
es_es: OpenGL: Muestreo Múltiple AA
ga: OpenGL: AA Ilshamplála
zh_cn: OpenGL：多采样抗锯齿

# #30014
source: OpenGL: Texture Smoothing
da_dk: OpenGL: udjævning af struktur
de_de: OpenGL: Texturglättung
es_es: OpenGL: Suavizado de Textura
ga: OpenGL: Smúdáil Uigeachta
zh_cn: OpenGL：纹理平滑

# #30015
source: OpenGL: Shadow Polygons
da_dk: OpenGL: skyggepolygoner
de_de: OpenGL: Schattenpolygone
es_es: OpenGL: Polígonos de Sombras
ga: OpenGL: Polagáin Scáth
zh_cn: OpenGL：阴影多边形

# #30016
source: OpenGL: Special 0 Alpha
es_es: OpenGL: Especial Alpha 0
ga: OpenGL: Speisialta 0 Alfa
zh_cn: OpenGL：特殊 0 Alpha

# #30017
source: OpenGL: NDS Depth Calculation
da_dk: OpenGL: NDS dybdeberegning
de_de: OpenGL: NDS-Tiefenberechnung
es_es: OpenGL: Cálculo de Profundidad NDS
ga: OpenGL: Ríomh Doimhneachta NDS
zh_cn: OpenGL：NDS深度计算

# #30018
source: OpenGL: Depth-LEqual Polygon Facing
da_dk: OpenGL: Retning på dybde-LEqual-polygon
de_de: OpenGL: Depth-LEqual- Polygonausrichtung
es_es: OpenGL: Orientación del Polígono de Profundidad LEqual
ga: OpenGL: Aghaidh a thabhairt ar pholagáin atá cothrom le doimhneacht
zh_cn: OpenGL：深度等效多边形面

# #30019
source: Soft3D: High-res Color Interpolation
da_dk: Soft3D: Farveinterpolation i høj opløsning
de_de: Soft3D: Hochaufgelöste Farbinterpolation
es_es: Soft3D: Interpolación de Colores en Alta Resolución
ga: Soft3D: Idirshuíomh Dath Ardtaifigh
zh_cn: Soft3D：高分辨率颜色插值

# #30020
source: Soft3D: Line Hack
da_dk: Soft3D: Linjehack
de_de: Soft3D: Linien-Hack
es_es: Soft3D: Hack de Línea
ga: Soft3D: Haic Líne
zh_cn: Soft3D：线条 Hack

# #30021
source: Soft3D: Texture Hack
da_dk: Soft3D: Teksturhack
de_de: Soft3D: Textur-Hack
es_es: Soft3D: Hack de Textura
ga: Soft3D: Haic Uigeachta
zh_cn: Soft3D：纹理 Hack

# #30022
source: Edge Marking
da_dk: Markering af kanter
de_de: Kantenmarkierung
es_es: Marcado de Bordes
ga: Marcáil Imeall
zh_cn: 边缘标记

# #30023
source: Texture Scaling (xBrz)
da_dk: Strukturskalering (xBrz)
de_de: Texturskalierung (xBrz)
es_es: Escalado de Textura (xBrz)
ga: Scálú Uigeachta (xBrz)
zh_cn: 纹理缩放（xBrz）

# #30024
source: Texture Deposterization
da_dk: Struktur deposterisering
de_de: Textur-Entposterisierung
es_es: Deposterización de Textura
ga: Díphoistéireacht Uigeachta
zh_cn: 纹理去色调分离

# #30025
source: Screen Layout
da_dk: Skærmlayout
de_de: Bildformat
es_es: Diseño de Pantalla
ga: Leagan Amach Scáileáin
zh_cn: 屏幕布局

# #30026
source: Screen Gap
da_dk: Skærmafstand
de_de: Bildschirmlücke
es_es: Separación entre Pantallas
ga: Bearna Scáileáin
zh_cn: 屏幕间隙

# #30027
source: Hybrid Layout: Ratio
da_dk: Hybridlayout: Forhold
de_de: Hybrides Layout: Verhältnis
es_es: Diseño Híbrido: Ratio
ga: Leagan Amach Hibrideach: Cóimheas
zh_cn: 混合布局：比率

# #30028
source: Hybrid Layout: Scale So Small Screen is 1:1px
da_dk: Hybridlayout: Skaler lille skærm til 1:1px
es_es: Diseño Híbrido: La Escala en Pantalla Pequeña es 1:1px
ga: Leagan Amach Hibrideach: Scála Mar sin is é 1:1px an scáileán beag
zh_cn: 混合布局：比例为1:1px的小屏幕

# #30029
source: Hybrid Layout: Show Both Screens
da_dk: Hybridlayout: Vis begge skærme
de_de: Hybrides Layout: Beide Bildschirme anzeigen
es_es: Diseño Híbrido: Mostrar Ambas Pantallas
ga: Leagan Amach Hibrideach: Taispeáin an Dá Scáileán
zh_cn: 混合布局：显示两个屏幕

# #30030
source: Hybrid Layout: Cursor Always on Small Screen
da_dk: Hybridlayout: Markør er altid på lille skærm
de_de: Hybrides Layout: Cursor immer auf kleinem Bildschirm
es_es: Diseño Híbrido: Cursor Siempre en Pantalla Pequeña
ga: Leagan Amach Hibrideach: Cúrsóir i gcónaí ar an Scáileán Beag
zh_cn: 混合布局：光标始终位于小屏幕上

# #30031
source: Mouse/Pointer
da_dk: Mus/pegeredskab
de_de: Maus/Zeiger
es_es: Ratón/Puntero
ga: Luch/Cuairteoir
zh_cn: 鼠标/指针

# #30032
source: Pointer Type
da_dk: Type af pegeredskab
de_de: Zeigertyp
es_es: Tipo de Puntero
ga: Cineál Pointeora
zh_cn: 指针类型

# #30033
source: Mouse Speed
da_dk: Musens hastighed
de_de: Mausgeschwindigkeit
es_es: Velocidad del Ratón
ga: Luas na Luiche
zh_cn: 鼠标速度

# #30034
source: Pointer Rotation
da_dk: Rotation af pegeredskab
de_de: Zeigerdrehung
es_es: Rotación del Puntero
ga: Rothlú Pointeora
zh_cn: 指针旋转

# #30035
source: Pointer Mode for Left Analog
da_dk: Tilstand for pegeredskab ved venstre analog
de_de: Zeigermodus für linken Analogstick
es_es: Modo Puntero para Analógico Izquierdo
ga: Mód Pointeora don Analógach Clé
zh_cn: 左模拟的指针模式

# #30036
source: Pointer Mode for Right Analog
da_dk: Tilstand for pegeredskab ved højre analog
de_de: Zeigermodus für rechten Analogstick
es_es: Modo Puntero para Analógico Derecho
ga: Mód Pointeora don Analógach Deas
zh_cn: 右模拟的指针模式

# #30037
source: Emulated Pointer Deadzone Percent
da_dk: Procent af dødzone for emuleret pegeredskab
de_de: Emulierte Zeiger-Deadzone in Prozent
es_es: Porcentaje de Zona Muerta del Puntero Emulado
ga: Céatadán Crios Marbh Pointeora Aithrisithe
zh_cn: 模拟指针死区百分比

# #30038
source: Emulated Pointer Acceleration Modifier Percent
da_dk: Procent af accelereret modifikator for emuleret pegeredskab
de_de: Emulierter Zeiger-Beschleunigungsmodifikator in Prozent
es_es: Porcentaje del Modificador de Aceleración del Puntero Emulado
ga: Céatadán Modhnaitheora Luasghéaraithe Pointeora Aithrisithe
zh_cn: 模拟指针加速度修改器百分比

# #30039
source: Emulated Stylus Pressure Modifier Percent
da_dk: Trykmodificerende procent for emuleret pen
de_de: Emulierter Taststift-Druckmodifikator in Prozent
es_es: Porcentaje del Modificador de Presión del Lápiz Óptico Emulado
ga: Céatadán Modhnaitheora Brú Stílis Aithrisithe
zh_cn: 模拟触控笔压力修改器百分比

# #30040
source: Pointer Colour
da_dk: Farve på pegeredskab
de_de: Zeigerfarbe
es_es: Color del Puntero
ga: Dath an Phointeora
zh_cn: 指针颜色

# #30041
source: Microphone Button Noise Type
da_dk: Støjtype for mikrofonknap
de_de: Geräuschtyp Mikrofontaste
es_es: Tipo de Ruido del Botón del Micrófono
ga: Cineál Torainn Cnaipe Micreafóin
zh_cn: 麦克风按钮噪音类型
